# 1. カテゴリごとの絵文字定義
emoji_categories = {
  "表情・人": "😀😃😄😁😆😅🤣😂🙂🙃😉😊😇🥰😍🤩😘😗☺😚😙😋😛😜🤪🤨🧐🤓😎🥸🤩🥳😏😒😞😔😟😕🙁☹️😣😖😫😩🥺😢😭😤😠😡🤬🤯😳🥵🥶😱😨😰😥😓🤗🤔🤭🤫🤥😶😐😑😬🙄😯😦😧😮😲🥱😴🤤😪😵🤐🥴🤢🤮🤧😷🤒🤕🤑🤠😈👿👹👺🤡💩👻💀☠️👽👾🤖🎃😺😸😻😼😽🙀😿😾🤲👐🙌👏🤝👍👎👊✊🤛🤜🤞✌️🤟🤘👌🤌🤏👈👉👆👇☝️✋🤚🖐🖖👋🤙💪🖕✍️🙏👋🤚🖐️🖖🤙",
  "記号・ハート": "❤️🧡💛💚💙💜🖤🤍🤎💔❣️💕💞💓💗💖💘💝❤️‍🔥❤️‍🩹💖✨⭐🌟💫💥💢💦💨💭♨️⚠️⚡️❗❓❕❓❔‼️⁉️⭕❌♨️🉐㊙️㊗️🈲✅",
  "アクティビティ・スポーツ": "⚽️🏀🏈⚾️🥎🎾🏐🏉🎱🏓🏸🥅🏒🏑🏏🥏🪁🏹⛳️🪁🎿⛷️🏂🏋️‍♀️🤺🤼‍♂️🤸‍♀️⛹️‍♂️🤾‍♀️🏌️‍♂️🏇🧘‍♀️🏄‍♂️🏊‍♂️🚣‍♂️🚴‍♂️🚵‍♂️🏎️🏍️🛹🛼🧗‍♂️🚵‍♀️🛶⛸️🧗‍♀️🧗🤽‍♂️🤽‍♀️🤾‍♂️🤾‍♀️🏌️‍♂️🏌️‍♀️🏇🧘‍♂️🧘‍♀️🏄‍♂️🏄‍♀️🏊‍♂️🏊‍♀️🚣‍♂️🚣‍♀️🚴‍♂️🚴‍♀️",
  "イベント・記念日": "🎆🎇🧧🎑🎀🎁🎂🎈🎉🎊🎋🎍🎎🎏🎐🧨🧧✨🎇🎆🎐🎑🎏🎀🎁🎂🎈🎉🎊🎊🎂🍰🧁🥧🍫🍬🍭🍮🍯🍼🥂🍷🥃🍸🍹🍺🍻🥂🍷🥃🍸🍹🥤🧋🧃🍵☕🍼🍼🍴🥄🍳🥘🍲🥣🥗🕯️📅💌💍💎💐🌷🌹🌻🌼🌸🌺🥀☀️🌙⭐☁️⛱️❄️⛄🎄🎅🤶⛪🕋⛩️🕍",
  "交通機関・建物": "🚌🚐🚑🚒🚓🚕🚗🚙🚲🚃🚅🚈🚋🚝🚅🚢🚁🛫⛵🚲🏢🏣🏥🏦🏨🏪🏫🏬🏭🏰🏯🏠",
  "自然・動物": "🐶🐱🐭🐹🐰🦊🐻🐼🐨🐯🦁🐮🐷🐸🙈🙉🙊🐒🙊🐔🐧🐤🐣🦆🦅🦉🦇🐺🐗🐴🦄🐝🐛🦋🐌🐞🐜🦗🕷️🐢🐍🦎🦖🦕🐙🦑🦐🦞🦀🐡🐠🐟🐬🐳🐋🦈🐊🐅🐆🦓🐘🦍🦧🦣🦏🦛🐪🐫🦒🦘🦬🐃🐂🐄🐎🐖🐑🐏🐐🦌🐕🐩🐈"
}

# 2. 全ての有効な絵文字キャラクターを抽出
all_valid_chars = []
emoji_categories.each_value { |s| all_valid_chars += s.scan(/\X/) }
all_valid_chars.uniq!

# 3. 新しい絵文字を登録、または既存のもののカテゴリを更新
all_valid_chars.each do |char|
  category = emoji_categories.find { |_name, str| str.include?(char) }&.first.to_s
  
  emoji = Emoji.find_or_initialize_by(character: char)
  emoji.category = category
  emoji.save!
end
